# PANDAS : is a tool for data processing which helps in data analysis

-it provides functions and methods to efficiently manipulate large datasets
# Data structures in pandas

-series ( one dimensional array)

-Dataframe ( two dimensional array)

SERIES is a one-dimensional array with labels. it can contain any data type including integers,strings,floats, python objects and more.

DATAFRAME is a two-dimensional data structure with labels. we can use labels to locate data

In [2]:
import pandas as pd

In [3]:
# check pandas version
print(pd.__version__)

2.2.2

# Series create, manipulate, query, delete

In [4]:
# creating a series from a list.
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [5]:
order = [1,2,3,4,5]
s2 = pd.Series(arr, index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [9]:
import numpy as np
n=np.random.randn(5) # Creat a random Ndarray
index = ['a','b','c','d','e']
s2 = pd.Series(n, index=index)
s2

a   -0.764742
b   -0.288367
c   -1.069581
d   -1.716513
e   -1.489481
dtype: float64

In [10]:
# create series from dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
# you can modify the index of series
print(s1)
s1.index=['A','B','C','D','E']
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [12]:
# slicing
s1[:3]

A    0
B    1
C    2
dtype: int64

In [13]:
s1[2:]

C    2
D    3
E    4
dtype: int64

In [14]:
s1[::-1]

E    4
D    3
C    2
B    1
A    0
dtype: int64

In [16]:
s1[-2:]

D    3
E    4
dtype: int64

# series operations

In [35]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [37]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [44]:
s6 = pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [45]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [46]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [51]:
s7=s5.mul(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [48]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [52]:
print('median', s7.median())
print('max', s7.max())
print('min', s7.min())

median 16.0
max 27.0
min 0.0

# Create DataFrame

In [53]:
dates=pd.date_range('today',periods=6) # Define time sequence as index
dates

DatetimeIndex(['2025-05-02 06:53:33.655069', '2025-05-03 06:53:33.655069',
               '2025-05-04 06:53:33.655069', '2025-05-05 06:53:33.655069',
               '2025-05-06 06:53:33.655069', '2025-05-07 06:53:33.655069'],
              dtype='datetime64[ns]', freq='D')

In [55]:
dates=pd.date_range('today',periods=6) # Define time sequence as index
num_arr=np.random.randn(6,4) # import numpy random array
num_arr

array([[-1.19924414, -0.19047444, -1.99045637, -1.75964916],
       [ 0.7593718 ,  0.59775918,  2.71801546,  0.36592206],
       [-2.48878567, -1.14008309, -1.50986188, -1.11315001],
       [-0.04660362,  0.50712103,  0.9653348 , -0.52765673],
       [ 0.09762938, -0.35766904, -1.04434658, -0.11206446],
       [-1.49076993, -0.03952063,  0.77446794,  0.30617743]])

In [56]:
dates=pd.date_range('today',periods=6) # Define time sequence as index
num_arr=np.random.randn(6,4) # import numpy random array
columns=['A','B','C','D'] # Use the table as the column name

df1 = pd.DataFrame(num_arr, index=dates, columns=columns)
df1

                                   A         B         C         D
2025-05-02 07:06:32.179349  0.008995 -0.124122 -0.957221 -0.015275
2025-05-03 07:06:32.179349  0.758155  0.702323  0.463913 -0.017931
2025-05-04 07:06:32.179349 -0.423490  1.441562  0.162393  0.524003
2025-05-05 07:06:32.179349 -0.737534 -0.601222  0.867118  1.211686
2025-05-06 07:06:32.179349  0.021803  1.733795  0.673539 -0.387858
2025-05-07 07:06:32.179349 -2.021199 -1.370905  0.127116  0.727223

In [7]:
import numpy as np
import pandas as pd

In [16]:
# create dataframe with dictionary array

data = {'animal': ['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
        'age': [2.5,3,0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits':[1, 3, 2, 3, 1, 1, 2, 1, 2, 3],
        'priority': ['yes', 'yes', 'no','yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b' ,'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df2 = pd.DataFrame(data, index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       1       no
f    cat  2.0       1       no
g  snake  4.5       2       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       3       no

In [9]:
# see datatypes of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [13]:
df2.head(6)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       1       no
f    cat  2.0       1       no

In [15]:
df2.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       3       no

In [17]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [18]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 1, 'no'],
       ['cat', 2.0, 1, 'no'],
       ['snake', 4.5, 2, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 3, 'no']], dtype=object)

In [ ]:
# the above is a very  easy way to convert that into a numpy array.

In [19]:
df2.describe() # see statitical data of dataframe

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [20]:
df2.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    3      2    3    1    1      2    1    2    3
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [22]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       1       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       3       no
g  snake  4.5       2       no
e    dog  5.0       1       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [23]:
# Slicing dataframe
df2[1:3]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [24]:
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f    cat  2.0       1       no
a    cat  2.5       1      yes

In [25]:
# querry dataframe by tag
df2[['age', 'visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       1
f  2.0       1
g  4.5       2
h  NaN       1
i  7.0       2
j  3.0       3

In [26]:
df2.iloc[1:3] # query rows  2,3

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [21]:
df3 = df2.copy
df3

<bound method NDFrame.copy of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       1       no
f    cat  2.0       1       no
g  snake  4.5       2       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       3       no>

In [29]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [30]:
df3.loc['f', 'age']=1.5
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       1       no
f    cat  1.5       1       no
g  snake  4.5       2       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       3       no

In [34]:
df3[['age']].mean()

age    3.375
dtype: float64

In [35]:
df3['visits'].sum()

19

In [36]:
df3['visits'].min()

1

In [37]:
df3['visits'].max()

3

In [38]:
string = pd.Series(['A', 'C','D','Aaa','BaCa', np.nan, 'CBA', 'cow', 'owl'])
string

0       A
1       C
2       D
3     Aaa
4    BaCa
5     NaN
6     CBA
7     cow
8     owl
dtype: object

In [7]:
string = pd.Series(['A', 'C','D','Aaa','BaCa', np.nan, 'CBA', 'cow', 'owl'])
string.str.lower()

0       a
1       c
2       d
3     aaa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object

In [8]:
string = pd.Series(['A', 'C','D','Aaa','BaCa', np.nan, 'CBA', 'cow', 'owl'])
string.str.upper()

0       A
1       C
2       D
3     AAA
4    BACA
5     NaN
6     CBA
7     COW
8     OWL
dtype: object

# operations for DataFrame missing values

In [33]:
df3 = df2.copy()
df3.fillna(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  4.0       3      yes
e    dog  5.0       1       no
f    cat  2.0       1       no
g  snake  4.5       2       no
h    cat  4.0       1      yes
i    dog  7.0       2       no
j    dog  3.0       3       no

# in the above, the unknown data in row 'g' and 'h' are filled with 4.

In [27]:
df3 = df2.copy()
meanAge = df3['age'].mean()
df3['age'].fillna(meanAge)

a    2.5000
b    3.0000
c    0.5000
d    3.4375
e    5.0000
f    2.0000
g    4.5000
h    3.4375
i    7.0000
j    3.0000
Name: age, dtype: float64

In [32]:
df4 = df2.copy()
df4.dropna(how='any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       1       no
f    cat  2.0       1       no
g  snake  4.5       2       no
i    dog  7.0       2       no
j    dog  3.0       3       no

In [ ]:
# this are the two main things we do with missing data
-either we fill them or
- we drop them as can be seen above.

# so here the unknown rows which are 'g' and 'h' are dropped for the missing data.

# DataFrame file operations

In [38]:
df3.to_csv('animal.csv')

In [39]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(3)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no

# W3 SCHOOLS PANDAS PRACTICE

In [45]:
import pandas as pd

In [46]:

my dataset =  {'cars': ['BMW', 'Volvo','ford'],
              'passings': [3,7,2]}

myvar = pd.DataFrame(mydataset)
print(myvar)

SyntaxError: invalid syntax (4276470880.py, line 1)

In [47]:
# series
a = [1,2,3]
myvar = pd.Series(a)
print(myvar)

0    1
1    2
2    3
dtype: int64

In [49]:
a = [1,2,3]
myvar = pd.Series(a, index = ['x','y','z'])
print(myvar)

x    1
y    2
z    3
dtype: int64

In [50]:
# DataFrames
data = {"calories": [420, 380, 390,],
        "duration": [50,40,45]}

myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45